{
  "title": "House MD - Generic mocked movie",
  "year": "2005",
  "posterUrl": "https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTpuyyt-jkqBNz7rRElj_znOVAGQSAgOlja5pRGDKvsJBbc5KnX",
  "genres": [{"name": "Drama"}, {"name": "Romantic"}],
  "trailerYoutubeVideoId": "5DIADh4lMq8",
  "boxOffice": "500000",
  "languages": [{"name": "English"}, {"name": "Spanish"}],
  "countries":[{"name": "USA"}, {"name": "UK"}],
  "plot": "House (also called House, M.D.) is an American medical drama television series that originally ran on the Fox network for eight seasons, from November 16, 2004 to May 21, 2012. The series's main character is Dr. Gregory House (Hugh Laurie), an unconventional, misanthropic medical genius who, despite his dependence on pain medication, leads a team of diagnosticians at the fictional Princeton–Plainsboro Teaching Hospital (PPTH) in New Jersey. The series's premise originated with Paul Attanasio, while David Shore, who is credited as creator, was primarily responsible for the conception of the title character.The series's executive producers included Shore, Attanasio, Attanasio's business partner Katie Jacobs, and film director Bryan Singer. It was filmed largely in a neighborhood and business district in Los Angeles County's Westside called Century City. The show received high critical acclaim, and was consistently one of the highest rated series in the United States.House often clashes with his fellow physicians, including his own diagnostic team, because many of his hypotheses about patients' illnesses are based on subtle or controversial insights. His flouting of hospital rules and procedures frequently leads him into conflict with his boss, hospital administrator and Dean of Medicine Dr. Lisa Cuddy (Lisa Edelstein). House's only true friend is Dr. James Wilson (Robert Sean Leonard), head of the Department of Oncology. During the first three seasons, House's diagnostic team consists of Dr. Robert Chase (Jesse Spencer), Dr. Allison Cameron (Jennifer Morrison) and Dr. Eric Foreman (Omar Epps). At the end of the third season, this team disbands. Rejoined by Foreman, House gradually selects three new team members: Dr. Remy Thirteen Hadley (Olivia Wilde), Dr. Chris Taub (Peter Jacobson) and Dr. Lawrence Kutner (Kal Penn). Chase and Cameron continue to appear occasionally in different roles at the hospital. Kutner dies late in season five; early in season six, Cameron departs the hospital, and Chase returns to the diagnostic team. Thirteen takes a leave of absence for most of season seven, and her position is filled by medical student Martha M. Masters (Amber Tamblyn). Cuddy and Masters depart before season eight; Foreman becomes the new Dean of Medicine, while Dr. Jessica Adams (Odette Annable) and Dr. Chi Park (Charlyne Yi) join House's team.House was among the top 10 series in the United States from its second season through the fourth season. Distributed to 66 countries, House was the most-watched television program in the world in 2008.[3] The show received numerous awards, including five Primetime Emmy Awards, two Golden Globe Awards, a Peabody Award, and nine People's Choice Awards. On February 8, 2012, FOX announced that the eighth season, then in progress, would be its last.[4] The series finale aired on May 21, 2012, following an hour-long retrospective.",
  "runtime": "forever",
  "releaseDate": "28122005T000000",
  "reviews": [
    {
      "user": "Fabian",
      "userEmail": "fabian@yahoo.com",
      "text": "Let me put it simply. I am a physician, and as an inviolable rule, I HATE medical shows. Granted, TV series tend to be one dimensional, due to inherent difficulties in the genre, but \"doctor shows\" are something I avoid like the proverbial plague.\n\nAnd then one evening I caught \"House, MD\" and was completely drawn into the show. In House I find the anti-hero that I've been waiting for in a medical show. The guy who knows everything, but is wrong often enough to keep us all guessing. I enjoy the contrast of House and his cadre of young fresh faced colleagues, complete with starched white lab coats, who struggle as much with their professionally imposed constraints, and sense of decorum, as they do with his personality. And, wonder of wonders, the use of ironic and tragic comedy is without peer in what I've seen in the TV world in recent memory. In a nutshell, I really never know what any given character will say or do and it's that freshness that will keep me coming back for more. Somewhere there is a team of writers who actually know their craft, and an acting ensemble that knows how to pull it off. Now I can watch my TV one hour a week........"
      "account": {"name":  "testAccount1"}
    },
    {
      "user": "TestUser",
      "userEmail": "test@yahoo.com",
      "text": "Hugh Laurie as Dr. House is my new hero. This is a terrific show with some absolutely great writing. A little over the layman's head as far as medical jargon, but the characters, plot and script more than make up for any questions about a diagnosis. The show is really carried by House, but the team of doctors who work with him add dimension and depth to his character.\n\nAny negative comments I've read about the show dealt with complaints about how the television doctors don't diagnose the way the viewing medical professionals do. May I point out to these people, this is a television show. Please get a grip on reality and watch it for it's pure entertainment value.\n\nI hope this show has a good following and I'm already hoping for, and looking forward to, more seasons.",
      "account": {"name":  "testAccount2"}
    },
    {
      "user": "ReviewMaster",
      "userEmail": "review@yahoo.com",
      "text": "House is a brilliant show medically speaking but so much more than that at the same time. The show is a kind of \"24\" meets medicine extravaganza. The main character, Dr. Gregory House, is played beautifully by Hugh Laurie. Dr. House is a bitter but brilliant doctor who is crippled in one leg due to the inability of doctors to properly diagnose his problem in time. This makes him a decidedly bitter person when dealing with others yet he is one of the best doctors in his field of diagnostic medicine. He is being forced to serve his clinic hours that he had avoided for a number of years, and this is where the show takes place; in a walk in clinic. Each show is a mysterious new case that puts the patient's life on the line as time runs out. I am disheartened by all of the bad comments people are making about this show, but everyone I have seen this show with and everyone I have shown the show to love it and find it enormously entertaining, funny, and brilliant.",
      "account": {"name":  "testAccount3"}
    }
  ],
  "ratings": {
    "averageRating": "9",
    "votes": "5000000"
  },
  "actors": [
    {
      "name": "Hugh Laurie",
      "imageUrl": "https://media.npr.org/assets/img/2012/04/25/hughbreakcane_sq-2ae3d0235652e7edea59b5c8a8b2df7c96dc7516-s800-c85.jpg"
    },
    {
      "name": "Olivia Wilde",
      "imageUrl": "http://images.fanpop.com/images/image_uploads/Olivia-Wilde-house-md-791085_384_480.jpg"
    }
  ],
  "directors": [
    {
      "name": "Bryan Singer"
    }
  ]
}
